#Декомпозиция задания с калькулятором. 
#1. Запрос двух чисел от пользователя, запрос операнда.+ 
#2. Преобразование введенных чисел в целочисленный тип данных или в число с плавающей точкой в зависимости от содержимого ввода. ?
#3. Осуществление арифметических операций в зависимости от введенного операнда с выводом результата в консоль. +
#4. Все приложение выполняется в вечном цикле, после арифметических операций запрос у пользователя на продолжение работы с приложением, 
#если отказ - остановка вечного цикла, если подтверждение - повторение запроса ввода чисел и операндов. +
#5. Не забыть обработать исключения деление на ноль (ZeroDivisionError) и неверно-введенных чисел (ValueError)


while True:
	
	a=()
	b=()	
	while type(a)!=int and type(a)!=float:
		print('Введите значение а')
		a=input()	
		if ',' in a:
			a1=a.replace(',','.')
			a=a1	
		if '.' in a:
			try:
				a=float(a)
			except:
				print('Вы ввели не число')
		else:
			try:
				a=int(a)
			except:
				print('Вы ввели не число')
	
		
	while type(b)!=int and type(b)!=float:
		print('Введите значение b')
		b=input()	
		if ',' in b:
			b1=b.replace(',','.')
			b=b1	
		if '.' in b:
			try:
				b=float(b)
			except:
				print('Вы ввели не число')
		else:
			try:
				b=int(b)
			except:
				print('Вы ввели не число')
	
	
	
	print('Введите +,-,/ или *')
	x=()
	
	while x !='+' and x !="-" and x !='/' and x !='*':
		x=input(x)
		if x=='+':
			print(a+b)
		elif x=='-':
			print(a-b)
		elif x=='/':
			try:
				print(a/b)
			except ZeroDivisionError:
				print('Деление на ноль невозможно')
		elif x=='*':
			print(a*b)
		else:
			print('введите +,-,/,*')
	
	print('Для выхода из калькулятор нажмите "q". Для продолжения работы нажмите любой другой символ')
	y=str(input())
	if y=='q':
		break

    
